let MD5Hash = 
dynamic(["C79B27FE1440B11A99A5611C9D6C6A78",
"C78EE46FFBE5DD76D84FB6A74BF21474",
"C75A2B191DA91114CEEA80638BC54030",
"C71F125FB385FED2561F3870B4593F18"]);
DeviceFileEvents 
| where MD5 in(MD5Hash)